package java01_variables;

public class Variables_04 {

	public static void main(String[] args) {
		
		int data1;
		int data2 = 456;
		int data3;
		
		//----------------------------------------------------------
		
		int data4 = 768, data5, data6 = 8986, data7;
		
		//에러, 서로 다른 자료형을 ,(콤마)로 나열해서 선언할 수 없다
//		int data8, double data9;
		
	}
	
}

//** 유용한 단축키

//선택영역 조절하기 : shift + 방향키
//(마우스 드래그로 가능)

//커서를 고정하고 화면만 위/아래로 이동(스크롤) : ctrl + 방향키 위/아래

//선택한 줄 위/아래로 이동하기 : alt + 방향키 위/아래

//선택한 줄 위/아래로 복사하기 : ctrl + alt + 방향키 위/아래

//선택한 줄 삭제 : ctrl + d

//----------------------------------------------------------------------

//마우스

//한 단어 선택하기 : 더블클릭
//한 줄 선택하기 : 트리플클릭

//더블클릭or트리플클릭을 누른채로 움직이면 단어or줄 단위로 선택















